In [4]:
import pandas as pd

In [5]:
# 
file_path = './df_student_sample.csv'
data = pd.read_csv(file_path)

In [6]:
data

    name algol basic c++
0  Jerry     A     C  B+
1   Riah    A+     B   C
2   Paul     B    B+  C+

## 이렇게 index가 바뀜! CSV 파일을 그대로 불러오기 때문!

In [7]:
df2 = pd.read_csv(file_path, header = None)

In [8]:
df2

       0      1      2    3
0   name  algol  basic  c++
1  Jerry      A      C   B+
2   Riah     A+      B    C
3   Paul      B     B+   C+

In [17]:
df3 = pd.read_csv(file_path, index_col='name')
df3

      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Paul      B    B+  C+

In [13]:
# read excel
df1 = pd.read_excel('./df_excelwriter_1.xlsx', engine='openpyxl')
df2 = pd.read_excel('./df_excelwriter_1.xlsx', engine='openpyxl', header = None)

In [14]:
df1

    name algol basic c++
0  Jerry     A     C  B+
1   Riah    A+     B   C
2   Paul     B    B+  C+

In [15]:
df2

       0      1      2    3
0   name  algol  basic  c++
1  Jerry      A      C   B+
2   Riah     A+      B    C
3   Paul      B     B+   C+